Autodesk.Revit.DB.Structure.Rebar.SplitRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32,System.Boolean)
This will split the rebar in two sets.
First will contain the bars from index 0 - barIndex, and the second one will contain the bars from barIndex+1 to NumberOfBarPositions.
document:
The document.
rebarToSplit:
The rebar that will be split
barIndex:
The bar index where the split will be.
constrainSets:
If this is true, Rebar Plane handle of the second set will be constraint to the Out of Plane (or Rebar Plane if the layout is Single) handle of the first set. If it is false, it will be no constraint between the two resulted sets.
Returns:
Returns the ids of the rebars that are considerred to be split.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars, rebar sets with only one bar included or rebars that are part of a group can't be split.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2009